
set_input_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -min -add_delay 4.2 [get_ports {base_ram_data[*]}]
set_input_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -max -add_delay 19.000 [get_ports {base_ram_data[*]}]
set_input_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -min -add_delay 4.2 [get_ports {ext_ram_data[*]}]
set_input_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -max -add_delay 19.000 [get_ports {ext_ram_data[*]}]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -min -add_delay -1.800 [get_ports {base_ram_addr[*]}]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -max -add_delay 11.000 [get_ports {base_ram_addr[*]}]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -min -add_delay -1.800 [get_ports {base_ram_data[*]}]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -max -add_delay 11.000 [get_ports {base_ram_data[*]}]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -min -add_delay -1.800 [get_ports {ext_ram_addr[*]}]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -max -add_delay 11.000 [get_ports {ext_ram_addr[*]}]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -min -add_delay -1.800 [get_ports {ext_ram_data[*]}]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -max -add_delay 11.000 [get_ports {ext_ram_data[*]}]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -min -add_delay -1.800 [get_ports base_ram_ce_n]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -max -add_delay 11.000 [get_ports base_ram_ce_n]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -min -add_delay -1.800 [get_ports base_ram_be[*]]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -max -add_delay 11.000 [get_ports base_ram_be[*]]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -min -add_delay -1.800 [get_ports base_ram_oe_n]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -max -add_delay 11.000 [get_ports base_ram_oe_n]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -min -add_delay -1.800 [get_ports base_ram_we_n]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -max -add_delay 11.000 [get_ports base_ram_we_n]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -min -add_delay -1.800 [get_ports ext_ram_ce_n]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -max -add_delay 11.000 [get_ports ext_ram_ce_n]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -min -add_delay -1.800 [get_ports ext_ram_be[*]]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -max -add_delay 11.000 [get_ports ext_ram_be[*]]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -min -add_delay -1.800 [get_ports ext_ram_oe_n]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -max -add_delay 11.000 [get_ports ext_ram_oe_n]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -min -add_delay -1.800 [get_ports ext_ram_we_n]
set_output_delay -clock [get_clocks CLK_OUT2_clk_wiz_v3_6] -clock_fall -max -add_delay 11.000 [get_ports ext_ram_we_n]

set_false_path -to [get_pins -hier *_sync_reg/D]
set_false_path -to [get_pins -hier *_sync_reg[0]*/D]
set_false_path -to [get_pins -hier *rst_shifter_reg[*]/CLR]
set_false_path -to [get_pins {la/inst/ctrl/shifter_reg[*]/CLR}]
set_false_path -from [get_pins -hier *FlagToggle_clkA_reg/C] -to [get_pins -hier {*SyncA_clkB_reg[0]/D}]